IDEA Open Model
Loading Constructor (LoadingType, Int32)
 Constructor
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public Loading(
	LoadingType loadingType,
	int id
)
Public Sub New (
	loadingType As LoadingType,
	id As Integer
)
public:
Loading(
	LoadingType loadingType,
	int id
)
Parameters
loadingType
Type: IdeaRS.OpenModel.Result.LoadingType
Type of loading
id
Type: System.Int32
Id of loading
See Also
Reference
Loading Class
Loading Overload
IdeaRS.OpenModel.Result Namespace